Revit 2024 API
DocumentSet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	Document item
)
Visual Basic
Public Overridable Function Erase ( _
	item As Document _
) As Integer
Visual C++
public:
virtual int Erase(
	Document^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Document
The item to be erased.
Return Value
The number of items that were erased from the set.
See Also
DocumentSet Class
Autodesk.Revit.DB Namespace